### Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as &lt;WORKER_NAME&gt;.

In [1]:
import mysql.connector as dd

In [2]:
mydb = dd.connect(host ='localhost', user = 'root', passwd = 'Manishaqwerm1106')

In [3]:
cursor = mydb.cursor()

In [4]:
cursor.execute("SHOW DATABASES")

In [5]:
cursor.fetchall()

[('employee',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

In [6]:
cursor.execute("CREATE TABLE employee.workers (ID INT(10),FIRST_NAME VARCHAR(30), SALARY float(10,5), PRIMARY KEY(ID))")

ProgrammingError: 1050 (42S01): Table 'workers' already exists

In [ ]:
cursor.execute("""INSERT INTO employee.workers VALUES (102,'ZEKE',10000)""")

In [ ]:
cursor.execute("""INSERT INTO employee.workers VALUES (103,'AKASH',10000)""")

In [ ]:
cursor.execute("""INSERT INTO employee.workers VALUES (104,'EHSAN',10000)""")

In [ ]:
cursor.execute("""INSERT INTO employee.workers VALUES (105,'ANOUSHKA',10000)""")

In [ ]:
cursor.execute("""INSERT INTO employee.workers VALUES (106,'SALONI',10000)""")

In [ ]:
cursor.execute("SELECT * FROM employee.workers")

In [ ]:
cursor.fetchall()

In [ ]:
cursor.execute("SELECT FIRST_NAME FROM employee.workers WHERE id = 101")

In [ ]:
cursor.fetchall()

### Q-2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [ ]:
cursor.execute("ALTER TABLE employee.workers ADD Department VARCHAR(10)")

In [ ]:
cursor.execute("UPDATE employee.workers SET Department = 'a' WHERE id = 101")

In [ ]:
cursor.execute("UPDATE employee.workers SET Department = 'b' WHERE id = 102")

In [ ]:
cursor.execute("UPDATE employee.workers SET Department = 'b' WHERE id = 103")

In [ ]:
cursor.execute("UPDATE employee.workers SET Department = 'a' WHERE id = 104")

In [ ]:
cursor.execute("UPDATE employee.workers SET Department = 'x' WHERE id = 105")

In [ ]:
cursor.execute("UPDATE employee.workers SET Department = 'a' WHERE id = 106")

In [ ]:
cursor.execute("SELECT DISTINCT(Department) FROM employee.workers")

In [ ]:
cursor.fetchall()

In [ ]:
cursor.execute("SELECT COUNT(DISTINCT(Department)) FROM employee.workers")

In [ ]:
cursor.fetchall()

### Q-3. Write an SQL query to show the last 5 record from a table.

In [10]:
cursor.execute("SELECT * FROM (SELECT * FROM employee.workers ORDER BY id DESC) as a LIMIT 5")

In [11]:
cursor.fetchall()

[(106, 'SALONI', 10000.0, None),
 (105, 'ANOUSHKA', 10000.0, None),
 (104, 'EHSAN', 10000.0, None),
 (103, 'AKASH', 10000.0, None),
 (102, 'ZEKE', 10000.0, None)]

In [12]:
cursor.execute("SELECT * FROM employee.workers ORDER BY id DESC LIMIT 5")

In [13]:
cursor.fetchall()

[(106, 'SALONI', 10000.0, None),
 (105, 'ANOUSHKA', 10000.0, None),
 (104, 'EHSAN', 10000.0, None),
 (103, 'AKASH', 10000.0, None),
 (102, 'ZEKE', 10000.0, None)]